package com.company;

public class Main {

    public static void main(String[] args) {

        /*
Дан класс FileReceiver, предназначенный для получения файла по сети и его
сохранения в локальной файловой системе. Определите парный к нему класс
FileSender, который отправляет по сети файл, предназначенный для получения
классом FileReceiver
         */


        System.out.println("Successfully");
    }
}
