package com.company;

import java.io.FileNotFoundException;

public class Main {

    public static void main(String[] args) {

        /*
Определите класс SimpleChat, предназначенный для обмена текстовыми
сообщениями между двумя пользователями в сети. Класс должен реализовывать
интерфейс ISimpleChat. Класс может работать в двух режимах:
1. В режиме сервера приложение ожидает запроса на соединение от клиента;
2. В режиме клиента приложение прежде всего запрашивает у пользователя
адрес и порт сервера, а затем устанавливает соединение с сервером.
Инициатором завершения сеанса может выступать как клиент, так и сервер
приложения.
Приложение может иметь консольный или графический интерфейс.
Интерфейс ISimpleChat и класс ChatException прилагаются.
         */


        System.out.println("Successfully");
    }
}
